CW commands control Morse code keying and parameters. 

> [!WARNING]
> This has been generated by AI and accuracy is not guaranteed.

### CW BREAK_IN

Enable/disable CW break-in (QSK).

```
C[D]<seq_number>|cw break_in <0|1>
```

**Parameters:**
- `<0|1>` = disable/enable break-in

**Example:**
```
C50|cw break_in 1
```

**Response:**
```
R50|0||                                          (success - break-in enabled)
```

### CW BREAK_IN_DELAY

Set CW break-in delay in milliseconds.

```
C[D]<seq_number>|cw break_in_delay <0-2000>
```

**Parameters:**
- `<0-2000>` = delay in milliseconds

**Example:**
```
C51|cw break_in_delay 100
```

**Response:**
```
R51|0||                                          (success - break-in delay set)
```

### CW CWL_ENABLED

Enable/disable CWL (CW Learning).

```
C[D]<seq_number>|cw cwl_enabled <0|1>
```

**Parameters:**
- `<0|1>` = disable/enable CWL

**Example:**
```
C52|cw cwl_enabled 0
```

**Response:**
```
R52|0||                                          (success - CWL disabled)
```

### CW IAMBIC

Enable/disable iambic keyer.

```
C[D]<seq_number>|cw iambic <0|1>
```

**Parameters:**
- `<0|1>` = disable/enable iambic keyer

**Example:**
```
C53|cw iambic 1
```

### CW KEY

Control CW key state.

```
C[D]<seq_number>|cw key <0|1> time=<timestamp> index=<n> client_handle=<handle>
```

**Parameters:**
- `<0|1>` = key up/down
- `<timestamp>` = timing timestamp
- `<n>` = key index
- `<handle>` = client handle

**Example:**
```
C54|cw key 1 time=1234567890 index=0 client_handle=0x12345678
```

### CW KEY IMMEDIATE

Immediate CW key control.

```
C[D]<seq_number>|cw key immediate <0|1>
```

**Parameters:**
- `<0|1>` = key up/down immediately

**Example:**
```
C55|cw key immediate 1
```

### CW MODE

Set iambic keyer mode.

```
C[D]<seq_number>|cw mode <0|1>
```

**Parameters:**
- `<0|1>` = Iambic A (0) or Iambic B (1)

**Example:**
```
C56|cw mode 1
```

### CW PITCH

Set CW sidetone pitch.

```
C[D]<seq_number>|cw pitch <100-6000>
```

**Parameters:**
- `<100-6000>` = pitch frequency in Hz

**Example:**
```
C57|cw pitch 600
```

**Response:**
```
R57|0||                                          (success - CW pitch set)
```

### CW PTT

Control CW PTT state.

```
C[D]<seq_number>|cw ptt <0|1> time=<timestamp> index=<n> client_handle=<handle>
```

**Parameters:**
- `<0|1>` = PTT off/on
- `<timestamp>` = timing timestamp
- `<n>` = PTT index
- `<handle>` = client handle

**Example:**
```
C58|cw ptt 1 time=1234567890 index=0 client_handle=0x12345678
```

### CW SIDETONE

Enable/disable CW sidetone.

```
C[D]<seq_number>|cw sidetone <0|1>
```

**Parameters:**
- `<0|1>` = disable/enable sidetone

**Example:**
```
C59|cw sidetone 1
```

### CW SWAP

Swap paddle configuration (dit/dah).

```
C[D]<seq_number>|cw swap <0|1>
```

**Parameters:**
- `<0|1>` = normal/swapped paddle

**Example:**
```
C60|cw swap 0
```

### CW SYNCCWX

Synchronize CWX buffer.

```
C[D]<seq_number>|cw synccwx <0|1>
```

**Parameters:**
- `<0|1>` = disable/enable CWX sync

**Example:**
```
C61|cw synccwx 1
```

### CW WPM

Set CW speed in words per minute.

```
C[D]<seq_number>|cw wpm <5-100>
```

**Parameters:**
- `<5-100>` = speed in words per minute

**Example:**
```
C62|cw wpm 20
```

**Response:**
```
R62|0||                                          (success - CW speed set)
```
