
Equalizer commands control audio equalizer settings for receive and transmit audio.

> [!WARNING]
> This has been generated by AI and accuracy is not guaranteed.

## Command Index
- [EQ RXSC MODE](#eq-rxsc)
- [EQ RXSC 63Hz](#eq-rxsc)
- [EQ RXSC 125Hz](#eq-rxsc)
- [EQ RXSC 250Hz](#eq-rxsc)
- [EQ RXSC 500Hz](#eq-rxsc)
- [EQ RXSC 1000Hz](#eq-rxsc)
- [EQ RXSC 2000Hz](#eq-rxsc)
- [EQ RXSC 4000Hz](#eq-rxsc)
- [EQ RXSC 8000Hz](#eq-rxsc)
- [EQ RXSC INFO](#eq-rxsc)
- [EQ TXSC MODE](#eq-txsc)
- [EQ TXSC 63Hz](#eq-txsc)
- [EQ TXSC 125Hz](#eq-txsc)
- [EQ TXSC 250Hz](#eq-txsc)
- [EQ TXSC 500Hz](#eq-txsc)
- [EQ TXSC 1000Hz](#eq-txsc)
- [EQ TXSC 2000Hz](#eq-txsc)
- [EQ TXSC 4000Hz](#eq-txsc)
- [EQ TXSC 8000Hz](#eq-txsc)
- [EQ TXSC INFO](#eq-txsc)
- [EQ APF GAIN](#apf-gain)
- [EQ APF MODE](#apf-mode)
- [EQ APF QFACTOR](#apf-qfactor)

### EQ RXSC

Control RX equalizer (receiver audio equalizer).

#### MODE

Enable/disable RX equalizer.

```
C[D]<seq_number>|eq rxsc mode=<0|1>
```

**Parameters:**
- `<0|1>` = disable/enable RX equalizer

**Example:**
```
C160|eq rxsc mode=1
```

**Response:**
```
R160|0||                                         (success - RX EQ enabled)
```

#### FREQUENCY BANDS

Set individual frequency band levels for RX equalizer.

```
C[D]<seq_number>|eq rxsc <frequency>=<level>
```

**Available Frequencies:**
- `63Hz` = 63 Hz band
- `125Hz` = 125 Hz band
- `250Hz` = 250 Hz band
- `500Hz` = 500 Hz band
- `1000Hz` = 1000 Hz band
- `2000Hz` = 2000 Hz band
- `4000Hz` = 4000 Hz band
- `8000Hz` = 8000 Hz band

**Parameters:**
- `<level>` = equalizer level (value range unknown - likely dB)

**Examples:**
```
C161|eq rxsc 63Hz=-10
C162|eq rxsc 125Hz=-5
C163|eq rxsc 250Hz=0
C164|eq rxsc 1000Hz=5
C165|eq rxsc 8000Hz=0
```

**Response:**
```
R161|0||                                         (success - level set)
```

#### INFO

Get RX equalizer information.

```
C[D]<seq_number>|eq rxsc info
```

**Example:**
```
C166|eq rxsc info
```

### EQ TXSC

Control TX equalizer (transmit audio equalizer).

#### MODE

Enable/disable TX equalizer.

```
C[D]<seq_number>|eq txsc mode=<0|1>
```

**Parameters:**
- `<0|1>` = disable/enable TX equalizer

**Example:**
```
C170|eq txsc mode=1
```

**Response:**
```
R170|0||                                         (success - TX EQ enabled)
```

#### FREQUENCY BANDS

Set individual frequency band levels for TX equalizer.

```
C[D]<seq_number>|eq txsc <frequency>=<level>
```

**Available Frequencies:**
- `63Hz` = 63 Hz band
- `125Hz` = 125 Hz band
- `250Hz` = 250 Hz band
- `500Hz` = 500 Hz band
- `1000Hz` = 1000 Hz band
- `2000Hz` = 2000 Hz band
- `4000Hz` = 4000 Hz band
- `8000Hz` = 8000 Hz band

**Parameters:**
- `<level>` = equalizer level (value range unknown - likely dB)

**Examples:**
```
C171|eq txsc 63Hz=-10
C172|eq txsc 125Hz=-5
C173|eq txsc 250Hz=0
C174|eq txsc 1000Hz=5
C175|eq txsc 8000Hz=0
```

**Response:**
```
R171|0||                                         (success - level set)
```

#### INFO

Get TX equalizer information.

```
C[D]<seq_number>|eq txsc info
```

**Example:**
```
C176|eq txsc info
```

### APF GAIN

Set Auto Peak Filter gain.

```
C[D]<seq_number>|eq apf gain <0-100>
```

**Parameters:**
- `<0-100>` = gain level

**Example:**
```
C161|eq apf gain 50
```

### APF MODE

Set Auto Peak Filter mode.

```
C[D]<seq_number>|eq apf mode <0|1>
```

**Parameters:**
- `<0|1>` = mode setting

**Example:**
```
C162|eq apf mode 1
```

### APF QFACTOR

Set Auto Peak Filter Q factor.

```
C[D]<seq_number>|eq apf qfactor <0-33>
```

**Parameters:**
- `<0-33>` = Q factor value

**Example:**
```
C163|eq apf qfactor 10
```