Profile commands manage radio configuration profiles for different operating scenarios.

> [!WARNING]
> This has been generated by AI and accuracy is not guaranteed.

## Command Index
- [PROFILE AUTOSAVE](#profile-autosave)
- [PROFILE DISPLAY LOAD](#load)
- [PROFILE DISPLAY INFO](#info)
- [PROFILE GLOBAL SAVE](#save)
- [PROFILE GLOBAL DELETE](#delete)
- [PROFILE GLOBAL LOAD](#load-1)
- [PROFILE GLOBAL INFO](#info-1)
- [PROFILE MIC SAVE](#save-1)
- [PROFILE MIC CREATE](#create)
- [PROFILE MIC RESET](#reset)
- [PROFILE MIC DELETE](#delete-1)
- [PROFILE MIC LOAD](#load-2)
- [PROFILE TRANSMIT SAVE](#save-2)
- [PROFILE TRANSMIT CREATE](#create-1)
- [PROFILE TRANSMIT RESET](#reset-1)
- [PROFILE TRANSMIT DELETE](#delete-2)
- [PROFILE TX LOAD](#load-3)
- [PROFILE TX INFO](#info-2)

### PROFILE AUTOSAVE

Control automatic profile saving.

```
C[D]<seq_number>|profile autosave <on|off>
```

**Parameters:**
- `on|off` = enable/disable auto-save

**Example:**
```
C320|profile autosave on
```

### PROFILE DISPLAY

Manage display profiles.

#### LOAD

Load a display profile.

```
C[D]<seq_number>|profile display load "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C321|profile display load "Contest Setup"
```

#### INFO

Get display profile information.

```
C[D]<seq_number>|profile display info "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C322|profile display info "Contest Setup"
```

### PROFILE GLOBAL

Manage global profiles.

#### SAVE

Save a global profile.

```
C[D]<seq_number>|profile global save "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C323|profile global save "DX Configuration"
```

**Response Codes:**

| Hex Code | Meaning |
|----------|----------|
| 00000000 | OK |
| 50000016 | Malformed Command |
| 5000002C | Incorrect number of parameters |

#### DELETE

Delete a global profile.

```
C[D]<seq_number>|profile global delete "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C324|profile global delete "Old Configuration"
```

**Response Codes:**

| Hex Code | Meaning |
|----------|----------|
| 00000000 | OK |
| 50000016 | Malformed Command |
| 5000002C | Incorrect number of parameters |

#### LOAD

Load a global profile.

```
C[D]<seq_number>|profile global load "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C325|profile global load "DX Configuration"
```

**Response Codes:**

| Hex Code | Meaning |
|----------|----------|
| 00000000 | OK |
| 50000016 | Malformed Command |
| 5000002C | Incorrect number of parameters |

#### INFO

Get global profile information.

```
C[D]<seq_number>|profile global info "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C326|profile global info "DX Configuration"
```

### MIC

Manage microphone profiles.

#### SAVE

> [!WARNING]
> **OBSOLETE** - This command is deprecated. Profiles are now saved automatically when changes are made. Use `profile mic create` to create a new microphone profile instead.

Save a microphone profile.

```
C[D]<seq_number>|profile mic save "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C327|profile mic save "Contest Mic"
```

**Response Codes:**

| Hex Code | Meaning |
|----------|----------|
| 00000000 | OK |
| 50000016 | Malformed Command |
| 5000002C | Incorrect number of parameters |

**Note:** When auto-save is enabled (`profile autosave on`), profile changes are saved automatically. This command will return an error indicating it is no longer supported.

#### CREATE

Create a new microphone profile.

```
C[D]<seq_number>|profile mic create "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C328|profile mic create "New Mic Setup"
```

#### RESET

Reset microphone profile to defaults.

```
C[D]<seq_number>|profile mic reset "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C329|profile mic reset "Contest Mic"
```

#### DELETE

Delete a microphone profile.

```
C[D]<seq_number>|profile mic delete "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C330|profile mic delete "Old Mic Setup"
```

**Response Codes:**

| Hex Code | Meaning |
|----------|----------|
| 00000000 | OK |
| 50000016 | Malformed Command |
| 5000002C | Incorrect number of parameters |

#### LOAD

Load a microphone profile.

```
C[D]<seq_number>|profile mic load "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C331|profile mic load "Contest Mic"
```

**Response Codes:**

| Hex Code | Meaning |
|----------|----------|
| 00000000 | OK |
| 50000016 | Malformed Command |
| 5000002C | Incorrect number of parameters |

### TRANSMIT

Manage transmit profiles.

#### SAVE

> [!WARNING]
> **OBSOLETE** - This command is deprecated. Profiles are now saved automatically when changes are made. Use `profile transmit create` to create a new transmit profile instead.

Save a transmit profile.

```
C[D]<seq_number>|profile transmit save "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C332|profile transmit save "High Power"
```

**Response Codes:**

| Hex Code | Meaning |
|----------|----------|
| 00000000 | OK |
| 50000016 | Malformed Command |
| 5000002C | Incorrect number of parameters |

**Note:** When auto-save is enabled (`profile autosave on`), profile changes are saved automatically. This command will return an error indicating it is no longer supported.

#### CREATE

Create a new transmit profile.

```
C[D]<seq_number>|profile transmit create "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C333|profile transmit create "QRP Setup"
```

#### RESET

Reset transmit profile to defaults.

```
C[D]<seq_number>|profile transmit reset "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C334|profile transmit reset "High Power"
```

#### DELETE

Delete a transmit profile.

```
C[D]<seq_number>|profile transmit delete "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C335|profile transmit delete "Old Setup"
```

**Response Codes:**

| Hex Code | Meaning |
|----------|----------|
| 00000000 | OK |
| 50000016 | Malformed Command |
| 5000002C | Incorrect number of parameters |

### TX

Additional transmit profile operations.

#### LOAD

Load a TX profile.

```
C[D]<seq_number>|profile tx load "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C336|profile tx load "Contest TX"
```

#### INFO

Get TX profile information.

```
C[D]<seq_number>|profile tx info "<name>"
```

**Parameters:**
- `<name>` = profile name

**Example:**
```
C337|profile tx info "Contest TX"
```