Radio commands control global radio settings and configuration parameters.

> [!WARNING]
> This has been generated by AI and accuracy is not guaranteed.

### RADIO BACKLIGHT

Set radio display backlight level.

```
C[D]<seq_number>|radio backlight <0-100>
```

**Parameters:**
- `<0-100>` = backlight level percentage

**Example:**
```
C10|radio backlight 75
```

**Response:**
```
R10|0||                                          (success - backlight set)
```

### RADIO CALLSIGN

Set radio callsign.

```
C[D]<seq_number>|radio callsign <callsign>
```

**Parameters:**
- `<callsign>` = amateur radio callsign

**Example:**
```
C11|radio callsign W1AW
```

**Response:**
```
R11|0||                                          (success - callsign set)
```

### RADIO FILTER_SHARPNESS

Set filter sharpness for different modes.

```
C[D]<seq_number>|radio filter_sharpness <voice|cw|digital> level=<0-3> auto_level=<0|1>
```

**Parameters:**
- Mode: `voice`, `cw`, or `digital`
- `level` = sharpness level (0-3)
- `auto_level` = enable automatic level adjustment

**Example:**
```
C12|radio filter_sharpness voice level=2 auto_level=1
```

**Response:**
```
R12|0||                                          (success - filter sharpness set)
```

### RADIO GPS

Control GPS module installation.

#### INSTALL
Install GPS module.
```
C[D]<seq_number>|radio gps install
```

#### UNINSTALL
Uninstall GPS module.
```
C[D]<seq_number>|radio gps uninstall
```

### LED_DISPLAY SET

Set LED display brightness for radios with Overlord PA (e.g., FLEX-6700).

```
C[D]<seq_number>|led_display set bright=<0-100>
```

**Parameters:**
- `bright` = LED display brightness level (0-100)

**Example:**
```
C12|led_display set bright=50
```

**Response:**
```
R12|0||                                          (success - LED brightness set)
```

**Notes:**
- This command is only available on radio models with Overlord PA
- For basic display backlight, use `radio backlight` instead

### RADIO NAME

Set radio name.

```
C[D]<seq_number>|radio name <name>
```

**Parameters:**
- `<name>` = radio identifier name

**Example:**
```
C13|radio name FlexRadio-6700
```

**Response:**
```
R13|0||                                          (success - radio name set)
```

### RADIO OSCILLATOR

Set 10 MHz reference oscillator type (FLEX-6400, FLEX-6400M, FLEX-6600, FLEX-6600M models).

```
C[D]<seq_number>|radio oscillator <oscillator_type>
```

**Parameters:**
- `<oscillator_type>` = oscillator configuration
  - `Auto` = Automatic oscillator selection (default)
  - `External` = External reference oscillator
  - `GPSDO` = GPS Disciplined Oscillator
  - `TCXO` = Temperature Compensated Crystal Oscillator

**Examples:**
```
C14|radio oscillator TCXO
C15|radio oscillator GPSDO
C16|radio oscillator Auto
```

**Response:**
```
R14|0||                                          (success - oscillator set)
```

### RADIO PLL_START

Start PLL calibration.

```
C[D]<seq_number>|radio pll_start
```

**Example:**
```
C15|radio pll_start
```

**Response:**
```
R15|0||                                          (success - PLL started)
```

### RADIO REBOOT

Reboot the radio.

```
C[D]<seq_number>|radio reboot
```

**Example:**
```
C16|radio reboot
```

**Response:**
```
R16|0||                                          (success - radio rebooting)
```

### RADIO SCREENSAVER

Set screensaver mode.

```
C[D]<seq_number>|radio screensaver <mode>
```

**Parameters:**
- `<mode>` = screensaver mode setting
  - `none` = No screensaver
  - `model` = Display radio model
  - `name` = Display radio name (default)
  - `callsign` = Display callsign

**Examples:**
```
C17|radio screensaver none
C18|radio screensaver callsign
C19|radio screensaver model
```

**Response:**
```
R17|0||                                          (success - screensaver set)
```

### RADIO SET

Configure various radio parameters. All set commands follow the pattern:

```
C[D]<seq_number>|radio set <parameter>=<value>
```

**Available Parameters:**

| Parameter | Value Range | Description |
|-----------|-------------|-------------|
| `band_persistence_enabled` | `0\|1` | Enable/disable band persistence |
| `binaural_rx` | `0\|1` | Enable/disable binaural RX |
| `cal_freq` | `MHz` | Set calibration frequency |
| `enforce_private_ip_connections` | `0\|1` | Enforce private IP connections only |
| `freq_error_ppb` | `ppb` | Set frequency error correction in parts per billion |
| `front_speaker_mute` | `0\|1` | Mute front speaker |
| `full_duplex_enabled` | `0\|1` | Enable/disable full duplex mode |
| `headphone_gain` | `0-100` | Set headphone gain level |
| `headphone_mute` | `0\|1` | Mute headphone output |
| `lineout_gain` | `0-100` | Set line output gain level |
| `lineout_mute` | `0\|1` | Mute line output |
| `low_latency_digital_modes` | `0\|1` | Enable low latency digital modes |
| `mf_enable` | `0\|1` | Enable MultiFlex operation |
| `mute_local_audio_when_remote` | `0\|1` | Mute local audio when remote client connected |
| `remote_on_enabled` | `0\|1` | Enable remote power-on capability |
| `rtty_mark_default` | `Hz` | Set default RTTY mark frequency |
| `snap_tune_enabled` | `0\|1` | Enable/disable snap tune |
| `tnf_enabled` | `0\|1` | Enable/disable Tracking Notch Filter |

**Examples:**
```
C20|radio set binaural_rx=1
C21|radio set cal_freq=10.000000
C22|radio set mf_enable=1
C23|radio set band_persistence_enabled=1
C24|radio set snap_tune_enabled=1
C25|radio set headphone_gain=50
C26|radio set lineout_mute=0
```

### RADIO STATIC_NET_PARAMS

Configure static network parameters or reset to DHCP.

#### SET STATIC PARAMETERS
Set static IP configuration.
```
C[D]<seq_number>|radio static_net_params ip=<ip_address> gateway=<gateway_ip> netmask=<netmask>
```

**Parameters:**
- `<ip_address>` = static IP address
- `<gateway_ip>` = gateway IP address  
- `<netmask>` = network mask

**Example:**
```
C18|radio static_net_params ip=192.168.1.100 gateway=192.168.1.1 netmask=255.255.255.0
```

#### RESET TO DHCP
Reset network configuration to DHCP.
```
C[D]<seq_number>|radio static_net_params reset
```

**Example:**
```
C19|radio static_net_params reset
```